#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-jxe3Xbu6izy9PseR

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refreshing...
module.api_lambdas["initLease"].data.archive_file.source_code: Refreshing...
module.api_lambdas["getHouses"].data.archive_file.source_code: Refreshing...
module.api_lambdas["createHouse"].data.archive_file.source_code: Refreshing...
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refreshing...
module.api_lambdas["houseOverview"].data.archive_file.source_code: Refresh complete after 0s [id=e577589b24b8fbb044463c9d89b1b1122f330187]
module.api_lambdas["initLease"].data.archive_file.source_code: Refresh complete after 0s [id=66f8eb07d25c97e7b2c8980dc7d151728270897c]
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=b8e8dff93783493389ac68438bb9a05cf6abee9e]
module.api_lambdas["createHouse"].data.archive_file.source_code: Refresh complete after 1s [id=25b75e1a5a6cff6b9496ba7c6c10e468b9d0c1e4]
module.api_lambdas["getHouses"].data.archive_file.source_code: Refresh complete after 1s [id=ddaec4202bf058bbe915c0faf38dca9890196b70]
module.api_lambdas["paymentCollector"].data.archive_file.source_code: Refresh complete after 1s [id=bc2c03be875cc2f88f8a3ad35ee21dd7b18823c3]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.maxfrise_user_pool.aws_cognito_user_pool.users_pool: Refreshing state... [id=us-west-2_3oKP9s8K9]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_user_pool.aws_cognito_user_pool_domain.domain: Refreshing state... [id=maxfrise]
module.maxfrise_user_pool.aws_cognito_user_pool_client.client[0]: Refreshing state... [id=7akg4pgnuu8tss89ht74djv5lp]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_lambdas["createHouse"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "function to create houses"
      + function_name                  = "createHouse"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::914036813947:role/iam_maxfrise_lambdas"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "createHouse_lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "wNepYGYWGd75yxV5XUzb2HdnX4wUUOOhkU1mnpP9nOI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # module.api_lambdas["createHouse"].aws_s3_object.source_s3_bucket will be created
  + resource "aws_s3_object" "source_s3_bucket" {
      + acl                    = "private"
      + bucket                 = "maxfrisedeployables"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "304fc71e3c5fca72fef1dd7f4e8566dd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "createHouse_lambda.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./functions/createHouse/dist/lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.api_lambdas["getHouses"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "function to get houses"
      + function_name                  = "getHouses"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::914036813947:role/iam_maxfrise_lambdas"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "getHouses_lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "SR5L/N/OugpAOr4jddNipJJEv4E364cOL2d9bt7CXVI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # module.api_lambdas["getHouses"].aws_s3_object.source_s3_bucket will be created
  + resource "aws_s3_object" "source_s3_bucket" {
      + acl                    = "private"
      + bucket                 = "maxfrisedeployables"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "6d5e80731e25a9873d421513a66afebc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "getHouses_lambda.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./functions/getHouses/dist/lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.api_lambdas["houseOverview"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "function to get the house overview"
      + function_name                  = "houseOverview"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::914036813947:role/iam_maxfrise_lambdas"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "houseOverview_lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "OxwrFYHPR+TnaPR3YQc3ssGONPs7X4tdwNgoSLtQCU8="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # module.api_lambdas["houseOverview"].aws_s3_object.source_s3_bucket will be created
  + resource "aws_s3_object" "source_s3_bucket" {
      + acl                    = "private"
      + bucket                 = "maxfrisedeployables"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "28f4d2d24e5eea1342a7a66657460c0e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "houseOverview_lambda.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./functions/houseOverview/dist/lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.api_lambdas["initLease"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "function to init the lease"
      + function_name                  = "initLease"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::914036813947:role/iam_maxfrise_lambdas"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "initLease_lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "FD6CTImPutOuHDsWV4bO4KZFSTjtTJdGQAhoS5HDKPw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # module.api_lambdas["initLease"].aws_s3_object.source_s3_bucket will be created
  + resource "aws_s3_object" "source_s3_bucket" {
      + acl                    = "private"
      + bucket                 = "maxfrisedeployables"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "7a775c4f68312b8707eb952fb304e5b3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "initLease_lambda.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./functions/initLease/dist/lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.api_lambdas["paymentCollector"].aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + description                    = "function to collect payments"
      + function_name                  = "paymentCollector"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::914036813947:role/iam_maxfrise_lambdas"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "maxfrisedeployables"
      + s3_key                         = "paymentCollector_lambda.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "6Z/dGH1u58oBgyhcLSxAe/3oJvJ/BJzibKYCokKULAw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + tracing_config (known after apply)
    }

  # module.api_lambdas["paymentCollector"].aws_s3_object.source_s3_bucket will be created
  + resource "aws_s3_object" "source_s3_bucket" {
      + acl                    = "private"
      + bucket                 = "maxfrisedeployables"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "6cf53aaf7c35fc26d36ca6fcd47e1eca"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "paymentCollector_lambda.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./functions/paymentCollector/dist/lambda.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @saudelog, Action: `pull_request`*